## :x: Apply結果

[GitHub Actions上の実行詳細へのリンク](https://github.com/melanmeg/my-cloudnative-entry/actions/runs/12222948739)



**Error: googleapi: Error 403: Caller does not have storage.buckets.create access to the Google Cloud project. Permission &#39;storage.buckets.create&#39; denied on resource (or it may not exist)., forbidden

  with google_storage_bucket.example_bucket,
  on main.tf line 1, in resource &#34;google_storage_bucket&#34; &#34;example_bucket&#34;:
   1: resource &#34;google_storage_bucket&#34; &#34;example_bucket&#34; {


Error: googleapi: Error 403: Caller does not have storage.buckets.create access to the Google Cloud project. Permission &#39;storage.buckets.create&#39; denied on resource (or it may not exist)., forbidden

  with google_storage_bucket.example_bucket2,
  on main.tf line 16, in resource &#34;google_storage_bucket&#34; &#34;example_bucket2&#34;:
  16: resource &#34;google_storage_bucket&#34; &#34;example_bucket2&#34; {

::error::Terraform exited with code 1.**

<details><summary>詳細はこちら</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_storage_bucket.example_bucket will be created
  + resource "google_storage_bucket" "example_bucket" {
      + effective_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + force_destroy               = true
      + id                          = (known after apply)
      + location                    = "US"
      + name                        = "test-project-373118-sample-bucket"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + uniform_bucket_level_access = (known after apply)
      + url                         = (known after apply)

      + lifecycle_rule {
          + action {
              + type          = "Delete"
                # (1 unchanged attribute hidden)
            }
          + condition {
              + age                    = 30
              + matches_prefix         = []
              + matches_storage_class  = []
              + matches_suffix         = []
              + with_state             = (known after apply)
                # (3 unchanged attributes hidden)
            }
        }

      + soft_delete_policy (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # google_storage_bucket.example_bucket2 will be created
  + resource "google_storage_bucket" "example_bucket2" {
      + effective_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + force_destroy               = true
      + id                          = (known after apply)
      + location                    = "US"
      + name                        = "test-project-373118-sample-bucket2"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + uniform_bucket_level_access = (known after apply)
      + url                         = (known after apply)

      + lifecycle_rule {
          + action {
              + type          = "Delete"
                # (1 unchanged attribute hidden)
            }
          + condition {
              + age                    = 30
              + matches_prefix         = []
              + matches_storage_class  = []
              + matches_suffix         = []
              + with_state             = (known after apply)
                # (3 unchanged attributes hidden)
            }
        }

      + soft_delete_policy (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
google_storage_bucket.example_bucket2: Creating...
google_storage_bucket.example_bucket: Creating...

Error: googleapi: Error 403: Caller does not have storage.buckets.create access to the Google Cloud project. Permission 'storage.buckets.create' denied on resource (or it may not exist)., forbidden

  with google_storage_bucket.example_bucket,
  on main.tf line 1, in resource "google_storage_bucket" "example_bucket":
   1: resource "google_storage_bucket" "example_bucket" {


Error: googleapi: Error 403: Caller does not have storage.buckets.create access to the Google Cloud project. Permission 'storage.buckets.create' denied on resource (or it may not exist)., forbidden

  with google_storage_bucket.example_bucket2,
  on main.tf line 16, in resource "google_storage_bucket" "example_bucket2":
  16: resource "google_storage_bucket" "example_bucket2" {

::error::Terraform exited with code 1.

```

</details>



<!-- github-comment: {"Command":"apply","JobName":"terraform-apply","PRNumber":10,"Program":"tfcmt","SHA1":"76da2f750955eb44a87b372d2a9f3bf22d21bca7","Vars":{},"WorkflowName":"terraform-apply"} -->